In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [3]:
tips = pd.read_csv('Desktop/examples/tips.csv')
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

In [4]:
grouped = tips.groupby(['day', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [5]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [6]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [7]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [8]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [9]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [10]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [11]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [12]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [13]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [14]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [15]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [16]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [17]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [18]:
f = lambda x: x.describe()
grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

In [19]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [20]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0      (1.361, 2.878]
1     (-0.157, 1.361]
2     (-0.157, 1.361]
3    (-1.674, -0.157]
4     (-0.157, 1.361]
5    (-1.674, -0.157]
6    (-1.674, -0.157]
7     (-0.157, 1.361]
8    (-1.674, -0.157]
9     (-0.157, 1.361]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.197, -1.674] < (-1.674, -0.157] < (-0.157, 1.361] < (1.361, 2.878]]

In [21]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)

In [22]:
 grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.197, -1.674] -1.562128  2.705102   44.0  0.281720
(-1.674, -0.157] -3.220789  2.990501  382.0  0.015128
(-0.157, 1.361]  -3.363159  3.607016  481.0  0.012194
(1.361, 2.878]   -3.541180  2.112919   93.0 -0.304571

In [23]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -3.220789  2.705102  100.0  0.138577
1     -2.393271  2.397065  100.0 -0.046109
2     -3.127003  2.636496  100.0 -0.028543
3     -3.158895  2.990501  100.0  0.083103
4     -2.557941  2.209801  100.0  0.035096
5     -1.742302  2.242386  100.0  0.121619
6     -3.363159  3.607016  100.0  0.009721
7     -2.654055  2.415262  100.0 -0.004071
8     -1.588131  2.793422  100.0 -0.018169
9     -3.541180  2.112919  100.0 -0.334073

In [24]:
tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [25]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1    0.062767
2         NaN
3   -1.420825
4         NaN
5   -0.704337
dtype: float64

ortalama ile doldurmak için;

In [26]:
s.fillna(s.mean())

0   -0.687465
1    0.062767
2   -0.687465
3   -1.420825
4   -0.687465
5   -0.704337
dtype: float64

In [27]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio         -2.067732
New York      0.526694
Vermont       0.260098
Florida       0.115094
Oregon       -0.853370
Nevada        0.294871
California   -0.419300
Idaho        -0.746163
dtype: float64

In [28]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -2.067732
New York      0.526694
Vermont            NaN
Florida       0.115094
Oregon       -0.853370
Nevada             NaN
California   -0.419300
Idaho              NaN
dtype: float64

In [29]:
data.groupby(group_key).mean()

East   -0.475315
West   -0.636335
dtype: float64

In [30]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio         -2.067732
New York      0.526694
Vermont      -0.475315
Florida       0.115094
Oregon       -0.853370
Nevada       -0.636335
California   -0.419300
Idaho        -0.636335
dtype: float64

In [31]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio         -2.067732
New York      0.526694
Vermont       0.500000
Florida       0.115094
Oregon       -0.853370
Nevada       -1.000000
California   -0.419300
Idaho        -1.000000
dtype: float64

In [32]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [33]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [34]:
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)

6D    6
8C    8
7D    7
2D    2
8H    8
dtype: int64

In [35]:
get_suit = lambda card: card[-1] 
# last letter is suit
deck.groupby(get_suit).apply(draw, n=2)

C  10C    10
   QC     10
D  JD     10
   6D      6
H  9H      9
   8H      8
S  7S      7
   10S    10
dtype: int64

In [36]:
deck.groupby(get_suit, 
             group_keys=False).apply(draw, n=2)

AC     1
5C     5
QD    10
6D     6
2H     2
7H     7
7S     7
8S     8
dtype: int64

In [37]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [38]:
df

  category      data   weights
0        a  0.073920  0.194753
1        a -1.140846  0.721482
2        a  0.823187  0.217601
3        a  1.204353  0.493948
4        b  0.696914  0.144130
5        b -0.253372  0.205658
6        b -1.467260  0.484359
7        b  0.783978  0.976441

In [39]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

category
a   -0.021311
b    0.056979
dtype: float64

In [40]:
close_px = pd.read_csv('Desktop/examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5472 entries, 1990-02-01 to 2011-10-14
Data columns (total 9 columns):
AA      5472 non-null float64
AAPL    5472 non-null float64
GE      5472 non-null float64
IBM     5472 non-null float64
JNJ     5472 non-null float64
MSFT    5472 non-null float64
PEP     5471 non-null float64
SPX     5472 non-null float64
XOM     5472 non-null float64
dtypes: float64(9)
memory usage: 427.5 KB

In [41]:
close_px[-4:]

               AA    AAPL     GE     IBM    JNJ   MSFT    PEP      SPX    XOM
2011-10-11  10.30  400.29  16.14  185.00  63.96  27.00  60.95  1195.54  76.27
2011-10-12  10.05  402.19  16.40  186.12  64.33  26.96  62.70  1207.25  77.16
2011-10-13  10.10  408.43  16.22  186.82  64.23  27.18  62.36  1203.66  76.37
2011-10-14  10.26  422.00  16.60  190.53  64.72  27.27  62.24  1224.58  78.11

In [42]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [43]:
rets = close_px.pct_change().dropna()

In [44]:
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
1990,0.595024,0.545067,0.752187,0.738361,0.801145,0.586691,0.783168,1.0,0.517586
1991,0.453574,0.365315,0.759607,0.557046,0.646401,0.524225,0.641775,1.0,0.569335
1992,0.398180,0.498732,0.632685,0.262232,0.515740,0.492345,0.473871,1.0,0.318408
1993,0.259069,0.238578,0.447257,0.211269,0.451503,0.425377,0.385089,1.0,0.318952
1994,0.428549,0.268420,0.572996,0.385162,0.372962,0.436585,0.450516,1.0,0.395078
1995,0.291532,0.161829,0.519126,0.416390,0.315733,0.453660,0.413144,1.0,0.368752
1996,0.292344,0.191482,0.750724,0.388497,0.569232,0.564015,0.421477,1.0,0.538736
1997,0.564427,0.211435,0.827512,0.646823,0.703538,0.606171,0.509344,1.0,0.695653
1998,0.533802,0.379883,0.815243,0.623982,0.591988,0.698773,0.494213,1.0,0.369264
1999,0.099033,0.425584,0.710928,0.486167,0.517061,0.631315,0.336593,1.0,0.315383
2000,0.265359,0.440161,0.610362,0.445114,0.189765,0.538005,0.077525,1.0,0.084163
2001,0.624069,0.577152,0.794632,0.696038,0.111493,0.696447,0.133975,1.0,0.336869
2002,0.748021,0.580548,0.822373,0.716490,0.584758,0.784728,0.487211,1.0,0.759933
2003,0.690466,0.545582,0.777643,0.741775,0.562399,0.750534,0.541487,1.0,0.662775
2004,0.591485,0.374283,0.728626,0.601740,0.354690,0.588531,0.466854,1.0,0.557742
2005,0.564267,0.467540,0.675637,0.516846,0.444728,0.562374,0.489559,1.0,0.631010
2006,0.487638,0.428267,0.612388,0.598636,0.394026,0.406126,0.335054,1.0,0.518514
2007,0.642427,0.508118,0.796945,0.603906,0.568423,0.658770,0.651911,1.0,0.786264
2008,0.781057,0.681434,0.777337,0.833074,0.801005,0.804626,0.709264,1.0,0.828303
2009,0.735642,0.707103,0.713086,0.684513,0.603146,0.654902,0.541474,1.0,0.797921
2010,0.745700,0.710105,0.822285,0.783638,0.689896,0.730118,0.626655,1.0,0.839057
2011,0.882045,0.691931,0.864595,0.802730,0.752379,0.800996,0.592029,1.0,0.859975

In [45]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

1990    0.408271
1991    0.266807
1992    0.450592
1993    0.236917
1994    0.361638
1995    0.258642
1996    0.147539
1997    0.196144
1998    0.364106
1999    0.329484
2000    0.275298
2001    0.563156
2002    0.571435
2003    0.486262
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [46]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [47]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
1990  1.512772   0.001395
1991  1.187351   0.000396
1992  1.832427   0.000164
1993  1.390470  -0.002657
1994  1.190277   0.001617
1995  0.858818  -0.001423
1996  0.829389  -0.001791
1997  0.749928  -0.001901
1998  1.164582   0.004075
1999  1.384989   0.003273
2000  1.733802  -0.002523
2001  1.676128   0.003122
2002  1.080795  -0.000219
2003  1.187770   0.000690
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [48]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [49]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [50]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [51]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [52]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [53]:
data

Ohio         -2.067732
New York      0.526694
Vermont            NaN
Florida       0.115094
Oregon       -0.853370
Nevada             NaN
California   -0.419300
Idaho              NaN
dtype: float64

In [54]:
data1 = {'Sample': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
 'Nationality': ['USA', 'Japan', 'USA', 'Japan', 'Japan', 'Japan', 'USA', 'USA', 'Japan', 'USA'],
 'Handedness': ['Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed',]}

data=pd.DataFrame(data1)

In [55]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [56]:
pd.crosstab(data.Nationality, 
            data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [57]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

In [58]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2019, 12, 11, 22, 31, 7, 591270)

In [59]:
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)
delta

datetime.timedelta(days=926, seconds=56700)

In [60]:
delta.days

926

In [61]:
delta.seconds

56700

In [62]:
from datetime import timedelta
start = datetime(2011, 1, 7)
start + timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [63]:
start - 2 * timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

In [64]:
stamp = datetime(2011, 1, 3)
str(stamp)

'2011-01-03 00:00:00'

In [65]:
stamp.strftime('%Y-%m-%d')

'2011-01-03'

In [66]:
value = '2011-01-03'
datetime.strptime(value, '%Y-%m-%d')

datetime.datetime(2011, 1, 3, 0, 0)

In [67]:
datestrs = ['7/6/2011', '8/6/2011']

In [68]:
[datetime.strptime(x, '%m/%d/%Y') for x in datestrs]

[datetime.datetime(2011, 7, 6, 0, 0), datetime.datetime(2011, 8, 6, 0, 0)]

In [69]:
from dateutil.parser import parse
parse('2011-01-03')

datetime.datetime(2011, 1, 3, 0, 0)

In [70]:
parse('Jan 31, 1997 10:45 PM')

datetime.datetime(1997, 1, 31, 22, 45)

In [71]:
parse('6/12/2011', dayfirst=True)

datetime.datetime(2011, 12, 6, 0, 0)

In [72]:
datestrs = ['2011-07-06 12:00:00', '2011-08-06 00:00:00']
pd.to_datetime(datestrs)

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00'], dtype='datetime64[ns]', freq=None)

In [73]:
idx = pd.to_datetime(datestrs + [None])
idx

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00', 'NaT'], dtype='datetime64[ns]', freq=None)

In [74]:
idx[2]

NaT

In [75]:
pd.isnull(idx)

array([False, False,  True])

In [76]:
from datetime import datetime
dates = [datetime(2011, 1, 2), datetime(2011, 1, 5),
         datetime(2011, 1, 7), datetime(2011, 1, 8),
         datetime(2011, 1, 10), datetime(2011, 1, 12)]
ts = pd.Series(np.random.randn(6), index=dates)
ts

2011-01-02   -0.439111
2011-01-05   -0.484857
2011-01-07   -1.621262
2011-01-08    0.589210
2011-01-10   -0.580591
2011-01-12    0.240900
dtype: float64

In [77]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [78]:
 ts + ts[::2]

2011-01-02   -0.878223
2011-01-05         NaN
2011-01-07   -3.242524
2011-01-08         NaN
2011-01-10   -1.161182
2011-01-12         NaN
dtype: float64

In [79]:
ts.index.dtype

dtype('<M8[ns]')

In [80]:
stamp = ts.index[0]
stamp

Timestamp('2011-01-02 00:00:00')

In [81]:
stamp = ts.index[2]
ts[stamp]

-1.6212618088305462

In [82]:
ts['1/10/2011']

-0.5805910190838538

In [83]:
ts['20110110']

-0.5805910190838538

In [84]:
longer_ts = pd.Series(np.random.randn(1000),
                      index=pd.date_range('1/1/2000', periods=1000))
longer_ts

2000-01-01    0.737701
2000-01-02    0.950936
2000-01-03   -1.448488
2000-01-04   -0.828972
2000-01-05   -0.020334
                ...
2002-09-22    1.357404
2002-09-23    2.232183
2002-09-24   -0.398622
2002-09-25    1.233440
2002-09-26    0.444676
Freq: D, Length: 1000, dtype: float64

In [85]:
longer_ts['2001']

2001-01-01   -1.378254
2001-01-02    0.056184
2001-01-03   -0.384910
2001-01-04    1.052133
2001-01-05    2.047148
                ...
2001-12-27   -0.673587
2001-12-28   -0.602356
2001-12-29   -0.493107
2001-12-30    1.273539
2001-12-31    0.819839
Freq: D, Length: 365, dtype: float64

In [86]:
longer_ts['2001-05']

2001-05-01   -0.174331
2001-05-02   -0.104458
2001-05-03    1.416034
2001-05-04    0.898251
2001-05-05    2.082383
2001-05-06    0.159735
2001-05-07    0.016067
2001-05-08   -0.264671
2001-05-09   -0.299175
2001-05-10    2.167220
2001-05-11   -1.370168
2001-05-12    1.686386
2001-05-13   -0.495476
2001-05-14   -1.478881
2001-05-15   -1.331379
2001-05-16    0.684646
2001-05-17   -1.081251
2001-05-18   -0.573565
2001-05-19   -0.779687
2001-05-20    0.933073
2001-05-21   -0.356234
2001-05-22    1.708651
2001-05-23   -0.789719
2001-05-24    1.248006
2001-05-25    0.690318
2001-05-26   -1.238740
2001-05-27   -0.551460
2001-05-28   -0.904029
2001-05-29    1.335085
2001-05-30    1.520296
2001-05-31   -0.769500
Freq: D, dtype: float64

In [87]:
ts[datetime(2011, 1, 7):]

2011-01-07   -1.621262
2011-01-08    0.589210
2011-01-10   -0.580591
2011-01-12    0.240900
dtype: float64

In [88]:
ts

2011-01-02   -0.439111
2011-01-05   -0.484857
2011-01-07   -1.621262
2011-01-08    0.589210
2011-01-10   -0.580591
2011-01-12    0.240900
dtype: float64

In [89]:
ts['1/6/2011':'1/11/2011']

2011-01-07   -1.621262
2011-01-08    0.589210
2011-01-10   -0.580591
dtype: float64

In [90]:
ts.truncate(after='1/9/2011')

2011-01-02   -0.439111
2011-01-05   -0.484857
2011-01-07   -1.621262
2011-01-08    0.589210
dtype: float64

In [91]:
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED')
long_df = pd.DataFrame(np.random.randn(100, 4),
                       index=dates,
                       columns=['Colorado', 'Texas',
                                'New York', 'Ohio'])
long_df.loc['5-2001']

            Colorado     Texas  New York      Ohio
2001-05-02 -0.718829 -0.137627 -1.484718 -0.154192
2001-05-09  0.231466 -1.604809 -0.335804  1.005589
2001-05-16 -0.236354 -1.597121  1.274023 -0.007423
2001-05-23 -0.379683 -0.383357  0.827026  1.995745
2001-05-30  0.467843 -0.417968 -2.195005 -0.345759

In [92]:
dates = pd.DatetimeIndex(['1/1/2000', '1/2/2000', '1/2/2000',
                          '1/2/2000', '1/3/2000'])
dup_ts = pd.Series(np.arange(5), index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [93]:
dup_ts.index.is_unique

False

In [94]:
dup_ts['1/3/2000'] # not duplicated

4

In [95]:
dup_ts['1/2/2000'] # duplicated

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int32

In [96]:
grouped = dup_ts.groupby(level=0)
grouped.mean()

2000-01-01    0
2000-01-02    2
2000-01-03    4
dtype: int32

In [97]:
grouped.count()

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [98]:
ts

2011-01-02   -0.439111
2011-01-05   -0.484857
2011-01-07   -1.621262
2011-01-08    0.589210
2011-01-10   -0.580591
2011-01-12    0.240900
dtype: float64

In [99]:
resampler = ts.resample('D')

In [100]:
index = pd.date_range('2012-04-01', '2012-06-01')
index

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
               '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
               '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
               '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
               '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
               '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
               '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
               '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
               '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
               '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
               '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
               '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [101]:
pd.date_range(start='2012-04-01', periods=20)

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20'],
              dtype='datetime64[ns]', freq='D')

In [102]:
pd.date_range(end='2012-06-01', periods=20)

DatetimeIndex(['2012-05-13', '2012-05-14', '2012-05-15', '2012-05-16',
               '2012-05-17', '2012-05-18', '2012-05-19', '2012-05-20',
               '2012-05-21', '2012-05-22', '2012-05-23', '2012-05-24',
               '2012-05-25', '2012-05-26', '2012-05-27', '2012-05-28',
               '2012-05-29', '2012-05-30', '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [103]:
pd.date_range('2000-01-01', '2000-12-01', freq='BM')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-28',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-29', '2000-10-31', '2000-11-30'],
              dtype='datetime64[ns]', freq='BM')

In [104]:
pd.date_range('2012-05-02 12:56:31', periods=5)

DatetimeIndex(['2012-05-02 12:56:31', '2012-05-03 12:56:31',
               '2012-05-04 12:56:31', '2012-05-05 12:56:31',
               '2012-05-06 12:56:31'],
              dtype='datetime64[ns]', freq='D')

In [105]:
pd.date_range('2012-05-02 12:56:31', periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

In [106]:
from pandas.tseries.offsets import Hour, Minute
hour = Hour()
hour

In [107]:
four_hours = Hour(4)
four_hours

In [108]:
pd.date_range('2000-01-01', '2000-01-03 23:59', freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [109]:
Hour(2) + Minute(30)

In [110]:
pd.date_range('2000-01-01', periods=10, freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [111]:
rng = pd.date_range('2012-01-01', '2012-09-01', freq='WOM-3FRI')
list(rng)

[Timestamp('2012-01-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-02-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-03-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-04-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-05-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-06-15 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-07-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2012-08-17 00:00:00', freq='WOM-3FRI')]

In [112]:
ts = pd.Series(np.random.randn(4),
               index=pd.date_range('1/1/2000', periods=4, freq='M'))
ts

2000-01-31   -0.586276
2000-02-29   -1.395287
2000-03-31    1.162285
2000-04-30   -0.324952
Freq: M, dtype: float64

In [113]:
ts.shift(2)

2000-01-31         NaN
2000-02-29         NaN
2000-03-31   -0.586276
2000-04-30   -1.395287
Freq: M, dtype: float64

In [114]:
ts.shift(-2)

2000-01-31    1.162285
2000-02-29   -0.324952
2000-03-31         NaN
2000-04-30         NaN
Freq: M, dtype: float64

In [115]:
ts / ts.shift(1) - 1

2000-01-31         NaN
2000-02-29    1.379915
2000-03-31   -1.833008
2000-04-30   -1.279580
Freq: M, dtype: float64

In [116]:
ts.shift(2, freq='M')

2000-03-31   -0.586276
2000-04-30   -1.395287
2000-05-31    1.162285
2000-06-30   -0.324952
Freq: M, dtype: float64

In [117]:
ts.shift(3, freq='D')

2000-02-03   -0.586276
2000-03-03   -1.395287
2000-04-03    1.162285
2000-05-03   -0.324952
dtype: float64

In [118]:
ts.shift(1, freq='90T')

2000-01-31 01:30:00   -0.586276
2000-02-29 01:30:00   -1.395287
2000-03-31 01:30:00    1.162285
2000-04-30 01:30:00   -0.324952
Freq: M, dtype: float64

In [119]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [120]:
now + MonthEnd()

Timestamp('2011-11-30 00:00:00')

In [121]:
now + MonthEnd(2)

Timestamp('2011-12-31 00:00:00')

In [122]:
offset = MonthEnd()
offset.rollforward(now)

Timestamp('2011-11-30 00:00:00')

In [123]:
offset.rollback(now)

Timestamp('2011-10-31 00:00:00')

In [124]:
ts = pd.Series(np.random.randn(20),
               index=pd.date_range('1/15/2000', periods=20, freq='4d'))
ts

2000-01-15   -1.608326
2000-01-19   -1.601064
2000-01-23    0.454962
2000-01-27   -0.070582
2000-01-31   -0.422790
2000-02-04   -1.299933
2000-02-08   -0.122340
2000-02-12   -1.620822
2000-02-16   -1.997802
2000-02-20    0.272280
2000-02-24    0.129661
2000-02-28    1.613894
2000-03-03    0.594319
2000-03-07    0.292209
2000-03-11    1.248466
2000-03-15    0.437712
2000-03-19   -0.879910
2000-03-23   -0.902336
2000-03-27   -0.390230
2000-03-31   -1.609778
Freq: 4D, dtype: float64

In [125]:
ts.groupby(offset.rollforward).mean()

2000-01-31   -0.649560
2000-02-29   -0.432152
2000-03-31   -0.151193
dtype: float64

In [126]:
ts.resample('M').mean()

2000-01-31   -0.649560
2000-02-29   -0.432152
2000-03-31   -0.151193
Freq: M, dtype: float64

In [127]:
import pytz
pytz.common_timezones[-5:]

['US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [128]:
tz = pytz.timezone('America/New_York')
tz

In [129]:
rng = pd.date_range('3/9/2012 9:30', periods=6, freq='D')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-03-09 09:30:00   -1.975860
2012-03-10 09:30:00   -0.618271
2012-03-11 09:30:00    0.088595
2012-03-12 09:30:00   -0.646671
2012-03-13 09:30:00   -2.280514
2012-03-14 09:30:00    1.410682
Freq: D, dtype: float64

Dizinin’in tz alanı yoktur:

In [130]:
print(ts.index.tz)

None

Bir saat dilimi ayarıyla tarih aralıkları oluşturulabilir:

In [131]:
pd.date_range('3/9/2012 9:30', periods=10, freq='D', tz='UTC')

DatetimeIndex(['2012-03-09 09:30:00+00:00', '2012-03-10 09:30:00+00:00',
               '2012-03-11 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00', '2012-03-16 09:30:00+00:00',
               '2012-03-17 09:30:00+00:00', '2012-03-18 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [132]:
ts

2012-03-09 09:30:00   -1.975860
2012-03-10 09:30:00   -0.618271
2012-03-11 09:30:00    0.088595
2012-03-12 09:30:00   -0.646671
2012-03-13 09:30:00   -2.280514
2012-03-14 09:30:00    1.410682
Freq: D, dtype: float64

In [133]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-09 09:30:00+00:00   -1.975860
2012-03-10 09:30:00+00:00   -0.618271
2012-03-11 09:30:00+00:00    0.088595
2012-03-12 09:30:00+00:00   -0.646671
2012-03-13 09:30:00+00:00   -2.280514
2012-03-14 09:30:00+00:00    1.410682
Freq: D, dtype: float64

In [134]:
ts_utc.index

DatetimeIndex(['2012-03-09 09:30:00+00:00', '2012-03-10 09:30:00+00:00',
               '2012-03-11 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [135]:
ts_utc.tz_convert('America/New_York')

2012-03-09 04:30:00-05:00   -1.975860
2012-03-10 04:30:00-05:00   -0.618271
2012-03-11 05:30:00-04:00    0.088595
2012-03-12 05:30:00-04:00   -0.646671
2012-03-13 05:30:00-04:00   -2.280514
2012-03-14 05:30:00-04:00    1.410682
Freq: D, dtype: float64

In [136]:
ts_utc.tz_convert('America/New_York')

2012-03-09 04:30:00-05:00   -1.975860
2012-03-10 04:30:00-05:00   -0.618271
2012-03-11 05:30:00-04:00    0.088595
2012-03-12 05:30:00-04:00   -0.646671
2012-03-13 05:30:00-04:00   -2.280514
2012-03-14 05:30:00-04:00    1.410682
Freq: D, dtype: float64

In [137]:
ts_eastern = ts.tz_localize('America/New_York')
ts_eastern.tz_convert('UTC')

2012-03-09 14:30:00+00:00   -1.975860
2012-03-10 14:30:00+00:00   -0.618271
2012-03-11 13:30:00+00:00    0.088595
2012-03-12 13:30:00+00:00   -0.646671
2012-03-13 13:30:00+00:00   -2.280514
2012-03-14 13:30:00+00:00    1.410682
Freq: D, dtype: float64

In [138]:
ts_eastern.tz_convert('Europe/Berlin')

2012-03-09 15:30:00+01:00   -1.975860
2012-03-10 15:30:00+01:00   -0.618271
2012-03-11 14:30:00+01:00    0.088595
2012-03-12 14:30:00+01:00   -0.646671
2012-03-13 14:30:00+01:00   -2.280514
2012-03-14 14:30:00+01:00    1.410682
Freq: D, dtype: float64

In [139]:
ts.index.tz_localize('Asia/Shanghai')

DatetimeIndex(['2012-03-09 09:30:00+08:00', '2012-03-10 09:30:00+08:00',
               '2012-03-11 09:30:00+08:00', '2012-03-12 09:30:00+08:00',
               '2012-03-13 09:30:00+08:00', '2012-03-14 09:30:00+08:00'],
              dtype='datetime64[ns, Asia/Shanghai]', freq='D')

In [140]:
stamp = pd.Timestamp('2011-03-12 04:00')
stamp_utc = stamp.tz_localize('utc')
stamp_utc.tz_convert('America/New_York')

Timestamp('2011-03-11 23:00:00-0500', tz='America/New_York')

In [141]:
stamp_moscow = pd.Timestamp('2011-03-12 04:00', tz='Europe/Moscow')
stamp_moscow

Timestamp('2011-03-12 04:00:00+0300', tz='Europe/Moscow')

In [142]:
stamp_utc.value

1299902400000000000

In [143]:
stamp_utc.tz_convert('America/New_York').value

1299902400000000000

In [144]:
from pandas.tseries.offsets import Hour
stamp = pd.Timestamp('2012-03-12 01:30', tz='US/Eastern')
stamp

Timestamp('2012-03-12 01:30:00-0400', tz='US/Eastern')

In [145]:
stamp + Hour()

Timestamp('2012-03-12 02:30:00-0400', tz='US/Eastern')

In [146]:
stamp = pd.Timestamp('2012-11-04 00:30', tz='US/Eastern')
stamp

Timestamp('2012-11-04 00:30:00-0400', tz='US/Eastern')

In [147]:
stamp + 2 * Hour()

Timestamp('2012-11-04 01:30:00-0500', tz='US/Eastern')

In [148]:
rng = pd.date_range('3/7/2012 9:30', periods=10, freq='B')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-03-07 09:30:00    0.245428
2012-03-08 09:30:00    0.485961
2012-03-09 09:30:00    0.347115
2012-03-12 09:30:00   -1.546901
2012-03-13 09:30:00   -0.209142
2012-03-14 09:30:00    0.117981
2012-03-15 09:30:00    0.838894
2012-03-16 09:30:00    1.278334
2012-03-19 09:30:00    0.763405
2012-03-20 09:30:00    0.545058
Freq: B, dtype: float64

In [149]:
ts1 = ts[:7].tz_localize('Europe/London')
ts2 = ts1[2:].tz_convert('Europe/Moscow')
result = ts1 + ts2
result.index

DatetimeIndex(['2012-03-07 09:30:00+00:00', '2012-03-08 09:30:00+00:00',
               '2012-03-09 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

In [150]:
p = pd.Period(2007, freq='A-DEC')
p

Period('2007', 'A-DEC')

In [151]:
p + 5

Period('2012', 'A-DEC')

In [152]:
p -2

Period('2005', 'A-DEC')

In [153]:
pd.Period('2014', freq='A-DEC') - p

In [154]:
rng = pd.period_range('2000-01-01', '2000-06-30', freq='M')
rng

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]', freq='M')

In [155]:
pd.Series(np.random.randn(6), index=rng)

2000-01   -1.266214
2000-02    1.018095
2000-03   -1.543192
2000-04    0.102397
2000-05    1.596322
2000-06    0.151996
Freq: M, dtype: float64

In [156]:
values = ['2001Q3', '2002Q2', '2003Q1']
index = pd.PeriodIndex(values, freq='Q-DEC')
index

PeriodIndex(['2001Q3', '2002Q2', '2003Q1'], dtype='period[Q-DEC]', freq='Q-DEC')

In [157]:
p = pd.Period('2007', freq='A-DEC')
p

Period('2007', 'A-DEC')

In [158]:
p.asfreq('M', how='start')

Period('2007-01', 'M')

In [159]:
p.asfreq('M', how='end')

Period('2007-12', 'M')

In [160]:
p = pd.Period('2007', freq='A-JUN')
p

Period('2007', 'A-JUN')

In [161]:
p.asfreq('M', 'start')

Period('2006-07', 'M')

In [162]:
p.asfreq('M', 'end')

Period('2007-06', 'M')

In [163]:
p = pd.Period('Aug-2007', 'M')
p.asfreq('A-JUN')

Period('2008', 'A-JUN')

In [164]:
rng = pd.period_range('2006', '2009', freq='A-DEC')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2006   -1.191524
2007    0.430745
2008    0.024424
2009   -1.411638
Freq: A-DEC, dtype: float64

In [165]:
ts.asfreq('M', how='start')

2006-01   -1.191524
2007-01    0.430745
2008-01    0.024424
2009-01   -1.411638
Freq: M, dtype: float64

In [166]:
ts.asfreq('B', how='end')

2006-12-29   -1.191524
2007-12-31    0.430745
2008-12-31    0.024424
2009-12-31   -1.411638
Freq: B, dtype: float64

In [167]:
p = pd.Period('2012Q4', freq='Q-JAN')
p

Period('2012Q4', 'Q-JAN')

In [168]:
p.asfreq('D', 'start')

Period('2011-11-01', 'D')

In [169]:
p.asfreq('D', 'end')

Period('2012-01-31', 'D')

In [170]:
p4pm = (p.asfreq('B', 'e') - 1).asfreq('T', 's') + 16 * 60
p4pm

Period('2012-01-30 16:00', 'T')

In [171]:
p4pm.to_timestamp()

Timestamp('2012-01-30 16:00:00')

In [172]:
rng = pd.period_range('2011Q3', '2012Q4', freq='Q-JAN')
ts = pd.Series(np.arange(len(rng)), index=rng)
ts

2011Q3    0
2011Q4    1
2012Q1    2
2012Q2    3
2012Q3    4
2012Q4    5
Freq: Q-JAN, dtype: int32

In [173]:
new_rng = (rng.asfreq('B', 'e') - 1).asfreq('T', 's') + 16 * 60
ts.index = new_rng.to_timestamp()

In [174]:
ts

2010-10-28 16:00:00    0
2011-01-28 16:00:00    1
2011-04-28 16:00:00    2
2011-07-28 16:00:00    3
2011-10-28 16:00:00    4
2012-01-30 16:00:00    5
dtype: int32

In [175]:
rng = pd.date_range('2000-01-01', periods=3, freq='M')
ts = pd.Series(np.random.randn(3), index=rng)
ts

2000-01-31    0.440210
2000-02-29    1.217346
2000-03-31   -0.434621
Freq: M, dtype: float64

In [176]:
pts = ts.to_period()
pts

2000-01    0.440210
2000-02    1.217346
2000-03   -0.434621
Freq: M, dtype: float64

In [177]:
rng = pd.date_range('1/29/2000', periods=6, freq='D')
ts2 = pd.Series(np.random.randn(6), index=rng)
ts2

2000-01-29   -0.331288
2000-01-30    0.484485
2000-01-31   -0.814676
2000-02-01   -1.612024
2000-02-02    0.062320
2000-02-03   -0.697522
Freq: D, dtype: float64

In [178]:
ts2.to_period('M')

2000-01   -0.331288
2000-01    0.484485
2000-01   -0.814676
2000-02   -1.612024
2000-02    0.062320
2000-02   -0.697522
Freq: M, dtype: float64

In [179]:
pts = ts2.to_period()
pts

2000-01-29   -0.331288
2000-01-30    0.484485
2000-01-31   -0.814676
2000-02-01   -1.612024
2000-02-02    0.062320
2000-02-03   -0.697522
Freq: D, dtype: float64

In [180]:
pts.to_timestamp(how='end')

2000-01-29 23:59:59.999999999   -0.331288
2000-01-30 23:59:59.999999999    0.484485
2000-01-31 23:59:59.999999999   -0.814676
2000-02-01 23:59:59.999999999   -1.612024
2000-02-02 23:59:59.999999999    0.062320
2000-02-03 23:59:59.999999999   -0.697522
Freq: D, dtype: float64

In [181]:
data = pd.read_csv('Desktop/examples/macrodata.csv')
data.head(5)

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [182]:
data.year

0      1959.0
1      1959.0
2      1959.0
3      1959.0
4      1960.0
        ...
198    2008.0
199    2008.0
200    2009.0
201    2009.0
202    2009.0
Name: year, Length: 203, dtype: float64

In [183]:
data.quarter

0      1.0
1      2.0
2      3.0
3      4.0
4      1.0
      ...
198    3.0
199    4.0
200    1.0
201    2.0
202    3.0
Name: quarter, Length: 203, dtype: float64

In [184]:
index = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                       freq='Q-DEC')
index

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', length=203, freq='Q-DEC')

In [185]:
data.index = index
data.infl

1959Q1    0.00
1959Q2    2.34
1959Q3    2.74
1959Q4    0.27
1960Q1    2.31
          ...
2008Q3   -3.16
2008Q4   -8.79
2009Q1    0.94
2009Q2    3.37
2009Q3    3.56
Freq: Q-DEC, Name: infl, Length: 203, dtype: float64

In [186]:
rng = pd.date_range('2000-01-01', periods=100, freq='D')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2000-01-01    0.801612
2000-01-02    0.455096
2000-01-03   -1.704369
2000-01-04    0.414098
2000-01-05    2.060202
                ...
2000-04-05   -0.372759
2000-04-06    0.203881
2000-04-07   -1.393269
2000-04-08   -0.369898
2000-04-09    0.045192
Freq: D, Length: 100, dtype: float64

In [187]:
ts.resample('M').mean()

2000-01-31    0.116534
2000-02-29   -0.079365
2000-03-31    0.231919
2000-04-30   -0.335446
Freq: M, dtype: float64

In [188]:
ts.resample('M', kind='period').mean()

2000-01    0.116534
2000-02   -0.079365
2000-03    0.231919
2000-04   -0.335446
Freq: M, dtype: float64

In [190]:
rng = pd.date_range('2000-01-01', periods=12, freq='T')
ts = pd.Series(np.arange(12), index=rng)
ts

2000-01-01 00:00:00     0
2000-01-01 00:01:00     1
2000-01-01 00:02:00     2
2000-01-01 00:03:00     3
2000-01-01 00:04:00     4
2000-01-01 00:05:00     5
2000-01-01 00:06:00     6
2000-01-01 00:07:00     7
2000-01-01 00:08:00     8
2000-01-01 00:09:00     9
2000-01-01 00:10:00    10
2000-01-01 00:11:00    11
Freq: T, dtype: int32

In [191]:
ts.resample('5min', closed='right').sum()

1999-12-31 23:55:00     0
2000-01-01 00:00:00    15
2000-01-01 00:05:00    40
2000-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [192]:
ts.resample('5min', closed='right', label='right').sum()

2000-01-01 00:00:00     0
2000-01-01 00:05:00    15
2000-01-01 00:10:00    40
2000-01-01 00:15:00    11
Freq: 5T, dtype: int32

In [193]:
ts.resample('5min', closed='right',
            label='right', loffset='-1s').sum()

1999-12-31 23:59:59     0
2000-01-01 00:04:59    15
2000-01-01 00:09:59    40
2000-01-01 00:14:59    11
Freq: 5T, dtype: int32

In [194]:
ts.resample('5min').ohlc()

                     open  high  low  close
2000-01-01 00:00:00     0     4    0      4
2000-01-01 00:05:00     5     9    5      9
2000-01-01 00:10:00    10    11   10     11

In [195]:
frame = pd.DataFrame(np.random.randn(2, 4),
                     index=pd.date_range('1/1/2000', periods=2,
                                         freq='W-WED'),
                     columns=['Colorado', 'Texas', 'New York', 'Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05  0.067579 -1.143883 -0.373062  0.599242
2000-01-12 -2.133021  0.810111 -1.361989  0.687883

In [196]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05  0.067579 -1.143883 -0.373062  0.599242
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12 -2.133021  0.810111 -1.361989  0.687883

In [197]:
 frame.resample('D').ffill()

            Colorado     Texas  New York      Ohio
2000-01-05  0.067579 -1.143883 -0.373062  0.599242
2000-01-06  0.067579 -1.143883 -0.373062  0.599242
2000-01-07  0.067579 -1.143883 -0.373062  0.599242
2000-01-08  0.067579 -1.143883 -0.373062  0.599242
2000-01-09  0.067579 -1.143883 -0.373062  0.599242
2000-01-10  0.067579 -1.143883 -0.373062  0.599242
2000-01-11  0.067579 -1.143883 -0.373062  0.599242
2000-01-12 -2.133021  0.810111 -1.361989  0.687883

In [198]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05  0.067579 -1.143883 -0.373062  0.599242
2000-01-06  0.067579 -1.143883 -0.373062  0.599242
2000-01-07  0.067579 -1.143883 -0.373062  0.599242
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12 -2.133021  0.810111 -1.361989  0.687883

In [199]:
frame.resample('W-THU').ffill()

            Colorado     Texas  New York      Ohio
2000-01-06  0.067579 -1.143883 -0.373062  0.599242
2000-01-13 -2.133021  0.810111 -1.361989  0.687883

In [200]:
frame = pd.DataFrame(np.random.randn(24, 4),
                     index=pd.period_range('1-2000', '12-2001',
                                           freq='M'),
                     columns=['Colorado', 'Texas', 'New York', 'Ohio'])
frame[:5]

         Colorado     Texas  New York      Ohio
2000-01 -0.708284  1.212445 -0.064540  0.544064
2000-02  0.098842 -1.212048  1.150037 -0.539687
2000-03 -0.709069  0.298566  0.395170 -1.188645
2000-04 -0.170182 -1.696208 -0.270356 -0.176868
2000-05  1.777571  0.930787  1.344133  0.303040

In [201]:
annual_frame = frame.resample('A-DEC').mean()
annual_frame

      Colorado     Texas  New York      Ohio
2000 -0.094120  0.039892 -0.026549 -0.403672
2001  0.118646 -0.255607 -0.092484 -0.120684

In [202]:
annual_frame.resample('Q-DEC').ffill()

        Colorado     Texas  New York      Ohio
2000Q1 -0.094120  0.039892 -0.026549 -0.403672
2000Q2 -0.094120  0.039892 -0.026549 -0.403672
2000Q3 -0.094120  0.039892 -0.026549 -0.403672
2000Q4 -0.094120  0.039892 -0.026549 -0.403672
2001Q1  0.118646 -0.255607 -0.092484 -0.120684
2001Q2  0.118646 -0.255607 -0.092484 -0.120684
2001Q3  0.118646 -0.255607 -0.092484 -0.120684
2001Q4  0.118646 -0.255607 -0.092484 -0.120684

In [203]:
annual_frame.resample('Q-DEC', convention='end').ffill()

        Colorado     Texas  New York      Ohio
2000Q4 -0.094120  0.039892 -0.026549 -0.403672
2001Q1 -0.094120  0.039892 -0.026549 -0.403672
2001Q2 -0.094120  0.039892 -0.026549 -0.403672
2001Q3 -0.094120  0.039892 -0.026549 -0.403672
2001Q4  0.118646 -0.255607 -0.092484 -0.120684

In [204]:
annual_frame.resample('Q-MAR').ffill()

        Colorado     Texas  New York      Ohio
2000Q4 -0.094120  0.039892 -0.026549 -0.403672
2001Q1 -0.094120  0.039892 -0.026549 -0.403672
2001Q2 -0.094120  0.039892 -0.026549 -0.403672
2001Q3 -0.094120  0.039892 -0.026549 -0.403672
2001Q4  0.118646 -0.255607 -0.092484 -0.120684
2002Q1  0.118646 -0.255607 -0.092484 -0.120684
2002Q2  0.118646 -0.255607 -0.092484 -0.120684
2002Q3  0.118646 -0.255607 -0.092484 -0.120684